---   

<h1 align="center">Introduction to Data Analyst and Data Science for beginners</h1>
<h1 align="center">Lecture no 2.17(Pandas-08)</h1>

---
<h3><div align="right">Ehtisham Sadiq</div></h3>

<img align="right" width="400" height="400"  src="images/pandas-apps.png"  >

## _Handling Missing Data.ipynb_

## Learning agenda of this notebook

1. Have an insight about the Dataset
2. Identify the Columns having Null/Missing values using `df.isna()` method
3. Handle/Impute the Null/Missing Values under the `math` Column using `df.loc[mask,col]=value`
4. Handle/Impute the Null/Missing Values under the `group` Column using `df.loc[mask,col]=value`
5. Handle Missing values under a Numeric/Categorical Column using `fillna()`
6. Handle Repeating Values (for same information) under the `session` Column
7. Create a new Column by Modifying an Existing Column
8. Delete Rows Having NaN values using `df.dropna()` method
9. Convert Categorical Variables into Numerical

## 1. Have an Insight about the Dataset

In [ ]:
! cat datasets/group-marks.csv

In [ ]:
# import the pandas library
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv')
df.head()

In [ ]:
df.shape

In [ ]:
df.describe(include='all')

- Whenever the **`pd.read.csv()`** method detects a missing value (nothing between two commas in a csv file or an empty cell in Excel) it flags it with NaN. There can be many reasons for these NaN values, one can be that the data is gathered via google form from people and this field might be optional and skipped.
- There can also be a scenario that a user has entered some text under a numeric field about which he/she do not have any information.

## 2. Identify the Columns having Null/Missing values
- The **`df.isna()`** method isrecommended to use than `df.isnull()`, which return a boolean same-sized object that indicates whether an element is NA value or not. Missing values get mapped to True. Everything else gets mapped to False values. Remember, characters such as empty strings ``''`` or `numpy.inf` are not considered NA values.
- The **`df.notna()`** method is recommended to use than `df.notnull()` methods return a boolean same-sized object that indicates whether an element is NA value or not. Non-missing values get mapped to True.

In [ ]:
df.isna().head()

In [ ]:
df.notna().head()

In [ ]:
# Now we can use sum() on this dataframe object of Boolean values (True is mapped to 1)
df.isna().sum()

In [ ]:
# Similarly, we can use sum() on this dataframe object of Boolean values (True is is mapped to 1)
df.notna().sum()

## 3. Handle/Impute the Null/Missing Values under the `math` Column

### a. Identify the Rows under the `math` Column having Null/Missing values
- The `df.isna()` method works equally good on Series objects as well

In [ ]:
# df.math.isna()

In [ ]:
mask = df.math.isna()
mask

In [ ]:
# df[mask]
# df.loc[mask,:]

In [ ]:
# This will return only those rows of dataframe having null values under the math column
df[mask]         # df[df.math.isna()]
df.loc[mask, :]  # df.loc[df.math.isna(), :]

### b. Replace the Null/Missing Values under the `math` Column
- After detecting the NaN values, the next question is, what value we should write in the cells where we have Null/Missing values under the `math` column
- Suppose, we want to put the average values at the place of missing values.

In [ ]:
# Compute the mean of math column
# df.math.mean()
# df.math

> By seeing the error, it appears that the `math` column do not have the `int64` or `float64` type. Let us check this out

In [ ]:
# Check out the data type of math column
df['math'].dtypes

In [ ]:
# We can also use the `df.info()` method to display the count of Non-Null columns, their datatypes, their names 
# and memory usage of that dataframe.

df.info()

- **What can be the reason for this?**
- Let us check out the values under this column

In [ ]:
df['math']

In [ ]:
# We can replace all such values using the `replace()` method
import numpy as np
df.replace('No Idea', np.nan).head()

In [ ]:
# Note the marks of Saadia in math are changed from string `No Idea` to `NaN`
# Since this seems working fine let us make inplace=True to make these changes in the original dataframe
df.replace('No Idea', np.nan, inplace=True)

In [ ]:
df.head()

In [ ]:
# Let us check the data type of math column
df['math'].dtypes

In [ ]:
# It is still Object, which is natural, however, we can change the datatype to `df.astype()` method
df['math'] = df['math'].astype(float)

In [ ]:
# Let us check the data type of math column
df['math'].dtypes

In [ ]:
# Let us compute the average of math marks again 
df.math.mean()

In [ ]:
mask = df.math.isna()
mask

In [ ]:
# List only those records under math column having Null values
df.loc[mask, 'math']

In [ ]:
# Let us replace these values with mean value of the math column
df.loc[(df.math.isna()),'math'] = df.math.mean()

In [ ]:
# Confirm the result
df.isna().sum()
#df.info()

In [ ]:
df.head()

### Handle the missing values under `English` column

In [ ]:
df.isna().sum()

In [ ]:
# df.english.dtype
# fetch rows which contain null or missing values
df.loc[df.english.isna(),:]

In [ ]:
# fill missing values with mean of data/column
df.loc[df.english.isna(),'english'] = df.english.mean()

In [ ]:
df.head(2)

In [ ]:
df.isna().sum()

## 4. Handle/Impute the Null/Missing Values under the `group` Column
- The `group` column contains categorical values, i.e., a value that can take on one of a limited, and usually fixed, number of possible values.

### a. Identify the Rows under the `group` Column having Null/Missing values

In [ ]:
df.head()

In [ ]:
mask = df.group.isna()
mask.head()

In [ ]:
df[mask]          # df[df.group.isna()]
df.loc[mask, :]   # df.loc[df.group.isna()]

In [ ]:
df.group.value_counts()

### b. Replace the Null/Missing Values under the `group` Column
- After detecting the NaN values, the next question is, what value we should write in the cells where we have Null/Missing values
- Since this is a categorical column having datatype object (group A, group B, group C, ...), so let us replace it with th value inside the column having the maximum frequency

In [ ]:
# Use value_counts() function which return a Series containing counts of unique values (in descending order)
# with the most frequently-occurring element at first. It excludes NA values by default.
df.group.value_counts()

In [ ]:
# Another way of doing is use the mode() function on the column
df.group.mode()

In [ ]:
# List only those records under group column having Null values
mask = df.group.isna()
df.loc[mask, 'group']     # df.loc[(df.group.isna()), 'group']

In [ ]:
# Let us replace these values with maximum occurring value in the `group` column
df.loc[(df.group.isna()),'group'] = 'group C'

In [ ]:
# Confirm the result
df.isna().sum()
#df.info()

In [ ]:
df.head()

>Note that in the original dataframe Arifa group information was missing, and now it is `group C`

## 5. Handle Missing values under a Numeric/Categorical Column using `fillna()`

### a. Replace the Null/Missing Values under the math Column using `fillna()`
- This is more recommended way of filling in the Null values within columns of your dataset rather than the use of the `loc` method.
```
object.fillna(value, method, inplace=True)
```
- The only required argument is either the `value`, with which we want to replace the missing values OR the `method` to be used to replace the missing values
- Returns object with missing values filled or None if ``inplace=True``

In [ ]:
# Let us read the dataset again with NA values under math column
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv')

In [ ]:
df.head()

>- Before proceeding, let us this time handle the string value `No Idea` under the math column while reading the csv file, instead of doing afterwards in the dataframe using the `replace()` method as we have done above.
>- For this we will use the `na_values` argument to the `pd.read_csv()` method, to which you can pass a single value or a list of values to be replaced with NaN

In [ ]:
df = pd.read_csv('datasets/group-marks.csv', na_values='No Idea')

In [ ]:
df.head()

In [ ]:
df.isna().sum()

In [ ]:
df.loc[df.math.isna()]

In [ ]:
# This time instead of loc, use fillna() method with just two arguments
# inplace=True parameter ensure that this happens in the original dataframe

df.math.fillna(value=df.math.mean(), inplace=True)

In [ ]:
# Confirm the result
df.isna().sum()
#df.info()

In [ ]:
df.head()

### b. Replace the Null/Missing Values under the `group` Column using `fillna()`

In [ ]:
# Let us read the dataset again with NA values
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv', na_values='No Idea')
df.head()

In [ ]:
df.isna().sum()

In [ ]:
# Once again instead of loc,let us use fillna() method with just two arguments

df.group.fillna('group C', inplace=True)

In [ ]:
# Confirm the result
df.isna().sum()
#df.info()

In [ ]:
# Let us fill the math, english and scholarship columns as well again
df.math.fillna(df.math.mean(), inplace=True)
df.english.fillna(df.english.mean(), inplace=True)
df.scholarship.fillna(df.scholarship.mean(), inplace=True)

In [ ]:
# Confirm the result
df.isna().sum()

### c. Replace the Null/Missing Values under the` math` and `group` Column using `ffill` and `bfill` Arguments
- In above examples, we have used the mean value in case of numeric column and mode value in case of a categorical column as the filling value to the `fillna()` method
```
object.fillna(value, method, inplace=True)
```

- We can pass `ffill` or `bfill` as method argument to the `ffillna()` method. This will replace the null values with other values from the DataFrame
- `ffill` (Forward fill): It fills the NaN value with the previous value
- `bfill` (Back fill): It fills the NaN value with the Next/Upcoming value

<img align="right" width="490" height="100"  src="images/bfill.PNG"  >
<img align="left" width="490" height="100"  src="images/ffill.PNG"  >

In [ ]:
# Let us read the dataset again with NA values
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv', na_values='No Idea')
df.head()

In [ ]:
df.isna().sum()

In [ ]:
# forward fill or ffill attribute
# If have NaN value, just carry forward the previous value
# using ffill attribute, you can fill the NaN value with the previous value in that column
df.fillna(method = 'ffill', inplace=True)
df.head()

In [ ]:
df.isna().sum()

>Is it working fine?

In [ ]:
df.fillna(method = 'bfill', inplace=True)
df.head()

In [ ]:
# Confirm the result
df.isna().sum()

## 6. Handle Repeating Values (for same information) under the `session` Column
- If you observe the values under the `session` column, you can observe that it is a categorical column containing six different categories (as values).
    - Notice that the categories `MORNING` and `MOR` are same
    - Similarly, `AFTERNOON` and `AFT` are same
    - Similarly, `EVENING` and `EVE` are same
- This happens when you have collected data from different sources, where same information is written in different ways
- So the `session` column has six different categories (as values) but should have only three

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv' )
df

In [ ]:
df.session

In [ ]:
# Let use check out the counts of unique values inside the session Column
df.session.value_counts()

###  Handle  the Repeating Values under the session Column using `map()`
- To keep the data clean we will map all these values to only three categories to `MOR` , `AFT` and `EVE` using the map() function.
```
df.map(mapping, na_action=None)
```
- The `map()` method is used for substituting each value in a Series with another value, that may be derived from a `dict`. The `map()` method returns a series after performing the mapping
- You can give `ignore` as second argument which will propagate NaN values, without passing them to the mapping correspondence.

In [ ]:
# To do this, let us create a new mapping (dictionary) 
dict1 = {
    'MORNING' : 'MOR',
    'MOR' : 'MOR',
    'AFTERNOON' : 'AFT',
    'AFT': 'AFT',
    'EVENING' : 'EVE',
    'EVE': 'EVE'
}

In [ ]:
# It returns a series with the same index as caller, the original series remains unchanged. 
# So we have assigned the resulting series to `df.session` series
df.session.map(dict1)

In [ ]:
df.session = df.session.map(dict1)

In [ ]:
# Count of new categories in the column session
# Observe we have managed to properly manage the values inside the session column
df.session.value_counts()

In [ ]:
# Let us verify the result
df.head()

## 7. Create a new Column by Modifying an Existing Column
- We have a column scholarship in the dataset, which is in Pak Rupees
- Suppose you want to have a new column which should represent the scholarship in US Dollars
- For that we need to add a new column by dividing each value of scholarship with 150

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv' )
df.head()

In [ ]:
df.scholarship.apply(lambda x: x/170)

In [ ]:
df['Scholarship_in_$'] = df.scholarship.apply(lambda x : x/150)

In [ ]:
df.head()

## 8. Delete Rows Having NaN values using `df.dropna()` method

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv')
df.head()

In [ ]:
df.shape

In [ ]:
df.isna().sum().sum()

In [ ]:
# You can use dropna() method to drop all the rows, it it has any na value
df1 = df.dropna()
df1.shape

In [ ]:
df1.head()

In [ ]:
# Default Arguments to dropna()
df2 = df.dropna(axis=0, how='any')
df2.shape

In [ ]:
# If we set how='all` it means drop a row only if all of its values are NA
df2 = df.dropna(axis=0, how='all')
df2.shape

In [ ]:
# Use of subset argument and pass it a list of columns based on whose values you want to drop a row
df2 = df.dropna(axis=0, how='any', subset=['math'])
df2.shape

In [ ]:
# Use of subset argument
df2 = df.dropna(axis=0, how='any', subset=['session'])
df2.shape

In [ ]:
# Having `how=all` and `subset=listofcolumnnames`, then it will 
# drop a row only if both the columns have a NA value in that row
df2 = df.dropna(axis=0, how='any', subset=['math', 'session'])
df2.shape

In [ ]:
# If we set the axis=1 and how=all, it means drop a column if all the  values under it is na
df2 = df.dropna(axis=1, how='all')
df2.shape

In [ ]:
# If we set the axis=1 and how=any, it means drop a column if any value under it is na
df2 = df.dropna(axis=1, how='any')
df2.shape

In [ ]:
df2.head()

## 9. Convert Categorical Variables into Numerical
- Most of the machine learning algorithms do not take categorical variables so we need to convert them into numerical ones. 
- We can do this using Pandas function `pd.get_dummies()`, which will create a binary column for each of the categories. 
```
pd.get_dummies(data, drop_first=False)
```
- Where, the only required argument is `data` which can be a dataframe or a series
- The parameter drop_first : bool, default False Whether to get k-1 dummies out of k categorical levels by removing the first level.

**Note:** Making a dummy variable will take all the `K` distinct values in one coumn and make `K` columns out of them

### a. Convert all categorical variables into dummy/indicator variables

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/group-marks.csv')
df.head()

In [ ]:
# currently we have 10 columns in the data
df.shape

In [ ]:
# Convert all categorical variables into dummy/indicator variables
df = pd.get_dummies(df)

In [ ]:
# Let us view the datafreame, keep a note on the number of columns
df.head()

In [ ]:
# The Number of columns has gone to 142 now
df.shape

- So we have 112 columns
- Even though one-hot encoding is a good way to convert your categorical columns to numerical columns
- But it adds a lot of dimensionality to your data, i.e., increase the number of columns
- It also become difficult to deal with that much number of columns
- This is a trade-off, which is handled by technique called dimensionality reduction

### b. Perform One-Hot Encoding for Categorical Column `gender` Only
- In our dataframe, the gender column is a categorical column having two values 'male' and 'female'
- It will create a dummy binary columns.  
- This is also known as `One Hot Encoding`. You will learn more encoding techniques in the data pre-processing module.

In [ ]:
import pandas as pd
df1 = pd.read_csv('datasets/group-marks.csv')
df1.head()

In [ ]:
# Convert only gender variable into dummy/indicator variables
df2 = pd.get_dummies(df1[['gender']])
df2.head()

In [ ]:
# Since we donot need two separate columns, so simply use the `drop_first` argument of get_dummies to handle this
df2 = pd.get_dummies(df1[['gender']], drop_first=True)
df2.head()

In [ ]:
# We will talk about join in the next session in detail.
df3 = df1.join(df2['gender_male'])
df3.head()

## Check Your Concepts:
- What is Pandas?

## Practice Questions
For the practice questions, we will use following dataset

In [1]:
import pandas as pd
import numpy as np
dict1 ={
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]
}
dict1

{'ord_no': [70001,
  nan,
  70002,
  70004,
  nan,
  70005,
  nan,
  70010,
  70003,
  70012,
  nan,
  70013],
 'purch_amt': [150.5,
  270.65,
  65.26,
  110.5,
  948.5,
  2400.6,
  5760,
  1983.43,
  2480.4,
  250.45,
  75.29,
  3045.6],
 'ord_date': ['2012-10-05',
  '2012-09-10',
  nan,
  '2012-08-17',
  '2012-09-10',
  '2012-07-27',
  '2012-09-10',
  '2012-10-10',
  '2012-10-10',
  '2012-06-27',
  '2012-08-17',
  '2012-04-25'],
 'customer_id': [3002,
  3001,
  3001,
  3003,
  3002,
  3001,
  3001,
  3004,
  3003,
  3002,
  3001,
  3001],
 'salesman_id': [5002,
  5003,
  5001,
  nan,
  5002,
  5001,
  5001,
  nan,
  5003,
  5002,
  5003,
  nan]}

In [2]:
df = pd.DataFrame(dict1)
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

### Write a Pandas program to detect missing values of a given DataFrame.(Hint : df.isna() ordf.isnull())

In [3]:
# df = pd.DataFrame(dict1)
# df.isnull().sum()
df.isna().sum()

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

### Write a Pandas program to identify the column(s) of a given DataFrame which have at least one missing value.(Hint : df.isna().sum or df.isna().any())

In [8]:
# mask = df.isnull().any()
# mask

mask = df.isna().any()
df.loc[:,mask]

     ord_no    ord_date  salesman_id
0   70001.0  2012-10-05       5002.0
1       NaN  2012-09-10       5003.0
2   70002.0         NaN       5001.0
3   70004.0  2012-08-17          NaN
4       NaN  2012-09-10       5002.0
5   70005.0  2012-07-27       5001.0
6       NaN  2012-09-10       5001.0
7   70010.0  2012-10-10          NaN
8   70003.0  2012-10-10       5003.0
9   70012.0  2012-06-27       5002.0
10      NaN  2012-08-17       5003.0
11  70013.0  2012-04-25          NaN

### Write a Pandas program to count the number of missing values in each column of a given DataFrame.(Hint: df.isna().sum())

In [11]:
((df.isna().sum())/len(df))*100

ord_no         33.333333
purch_amt       0.000000
ord_date        8.333333
customer_id     0.000000
salesman_id    25.000000
dtype: float64

### Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.(Hint : pd.read_csv(na_values) or df.replace())
For this question , use following dataset

In [13]:
dict1 = {
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,"--",70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,"?",12.43,2480.4,250.45, 3045.6],
'ord_date': ['?','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,"--",3002,3001,3001],
'salesman_id':[5002,5003,"?",5001,np.nan,5002,5001,"?",5003,5002,5003,"--"]}
dict1

{'ord_no': [70001,
  nan,
  70002,
  70004,
  nan,
  70005,
  '--',
  70010,
  70003,
  70012,
  nan,
  70013],
 'purch_amt': [150.5,
  270.65,
  65.26,
  110.5,
  948.5,
  2400.6,
  5760,
  '?',
  12.43,
  2480.4,
  250.45,
  3045.6],
 'ord_date': ['?',
  '2012-09-10',
  nan,
  '2012-08-17',
  '2012-09-10',
  '2012-07-27',
  '2012-09-10',
  '2012-10-10',
  '2012-10-10',
  '2012-06-27',
  '2012-08-17',
  '2012-04-25'],
 'customer_id': [3002,
  3001,
  3001,
  3003,
  3002,
  3001,
  3001,
  3004,
  '--',
  3002,
  3001,
  3001],
 'salesman_id': [5002,
  5003,
  '?',
  5001,
  nan,
  5002,
  5001,
  '?',
  5003,
  5002,
  5003,
  '--']}

In [14]:
df = pd.DataFrame(dict1)
df

   ord_no purch_amt    ord_date customer_id salesman_id
0   70001     150.5           ?        3002        5002
1     NaN    270.65  2012-09-10        3001        5003
2   70002     65.26         NaN        3001           ?
3   70004     110.5  2012-08-17        3003        5001
4     NaN     948.5  2012-09-10        3002         NaN
5   70005    2400.6  2012-07-27        3001        5002
6      --      5760  2012-09-10        3001        5001
7   70010         ?  2012-10-10        3004           ?
8   70003     12.43  2012-10-10          --        5003
9   70012    2480.4  2012-06-27        3002        5002
10    NaN    250.45  2012-08-17        3001        5003
11  70013    3045.6  2012-04-25        3001          --

In [16]:
df.replace({'?':np.nan, '--':np.nan}, inplace=True)

In [20]:
# df.salesman_id.fillna(df.salesman_id.mean())

### Write a Pandas program to drop the rows where at least one element is missing in a given DataFrame.(Hint : df.dropna())

In [21]:
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50         NaN       3002.0       5002.0
1       NaN     270.65  2012-09-10       3001.0       5003.0
2   70002.0      65.26         NaN       3001.0          NaN
3   70004.0     110.50  2012-08-17       3003.0       5001.0
4       NaN     948.50  2012-09-10       3002.0          NaN
5   70005.0    2400.60  2012-07-27       3001.0       5002.0
6       NaN    5760.00  2012-09-10       3001.0       5001.0
7   70010.0        NaN  2012-10-10       3004.0          NaN
8   70003.0      12.43  2012-10-10          NaN       5003.0
9   70012.0    2480.40  2012-06-27       3002.0       5002.0
10      NaN     250.45  2012-08-17       3001.0       5003.0
11  70013.0    3045.60  2012-04-25       3001.0          NaN

In [22]:
df.dropna(how='any')

    ord_no  purch_amt    ord_date  customer_id  salesman_id
3  70004.0      110.5  2012-08-17       3003.0       5001.0
5  70005.0     2400.6  2012-07-27       3001.0       5002.0
9  70012.0     2480.4  2012-06-27       3002.0       5002.0

### Write a Pandas program to drop the columns where at least one element is missing in a given DataFrame.(Hint : df.dropna())
For this question , ue following dataset

In [25]:
dict1 = {
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]}
df = pd.DataFrame(dict1)
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [26]:
# method1
df.dropna(axis=1, how='any')

    purch_amt  customer_id
0      150.50         3002
1      270.65         3001
2       65.26         3001
3      110.50         3003
4      948.50         3002
5     2400.60         3001
6     5760.00         3001
7     1983.43         3004
8     2480.40         3003
9      250.45         3002
10      75.29         3001
11    3045.60         3001

In [32]:
# df.isna().sum() == 0
# df.isna().sum()
mask = df.isna().sum() == 0
df.loc[:,mask]

    purch_amt  customer_id
0      150.50         3002
1      270.65         3001
2       65.26         3001
3      110.50         3003
4      948.50         3002
5     2400.60         3001
6     5760.00         3001
7     1983.43         3004
8     2480.40         3003
9      250.45         3002
10      75.29         3001
11    3045.60         3001

### Write a Pandas program to drop the rows where all elements are missing in a given DataFrame.(Hint : df.drop())
For this question, we will use following dataset

In [60]:
dict1 = {
'ord_no':[np.nan,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[np.nan,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': [np.nan,'2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[np.nan,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001]}
df = pd.DataFrame(dict1)
df

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3   70004.0     110.50  2012-08-17       3003.0
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11  70013.0    3045.60  2012-04-25       3001.0

In [38]:
# df.drop(labels=df.columns)

In [44]:
# df.isna().index

In [50]:
# df.loc[df.isna().index]
df.loc[:,df.isna().sum().index]

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3   70004.0     110.50  2012-08-17       3003.0
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11  70013.0    3045.60  2012-04-25       3001.0

### Write a Pandas program to keep the rows with at least 2 NaN values in a given DataFrame.(Hint: df.dropna(thresh=))

In [100]:
dict1 = {
'ord_no':[np.nan,np.nan,70002,np.nan,np.nan,70005,np.nan,70010,70003,70012,np.nan,np.nan],
'purch_amt':[np.nan,270.65,65.26,np.nan,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,np.nan],
'ord_date': [np.nan,'2012-09-10',np.nan,np.nan,'2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17',np.nan],
'customer_id':[np.nan,3001,3001,np.nan,3002,3001,3001,3004,3003,3002,3001,np.nan]}
df = pd.DataFrame(dict1)
df

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3       NaN        NaN         NaN          NaN
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11      NaN        NaN         NaN          NaN

In [64]:
# df.dropna(thresh=2)

### Write a Pandas program to drop those rows from a given DataFrame in which specific columns have missing values.(Hint : df.dropna(subset))

In [67]:
df.dropna(subset=['ord_no','ord_date'])

    ord_no  purch_amt    ord_date  customer_id
5  70005.0    2400.60  2012-07-27       3001.0
7  70010.0    1983.43  2012-10-10       3004.0
8  70003.0    2480.40  2012-10-10       3003.0
9  70012.0     250.45  2012-06-27       3002.0

### Write a Pandas program to keep the valid entries of a given DataFrame.(Hint : df.dropna)

In [70]:
# df.dropna()

### Write a Pandas program to calculate the total number of missing values in a DataFrame.

In [71]:
dfd

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3       NaN        NaN         NaN          NaN
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11      NaN        NaN         NaN          NaN

### Write a Pandas program to replace NaNs with a single constant value in specified columns in a DataFrame.(Hint : df.fillna())

In [79]:
df.customer_id.fillna(value=4000)

0     4000.0
1     3001.0
2     3001.0
3     4000.0
4     3002.0
5     3001.0
6     3001.0
7     3004.0
8     3003.0
9     3002.0
10    3001.0
11    4000.0
Name: customer_id, dtype: float64

### Write a Pandas program to replace NaNs with the value from the previous row or the next row in a given DataFrame.(Hint : df.fillna())

### Write a Pandas program to replace NaNs with median or mean of the specified columns in a given DataFrame.(Hint : df.fillna())

### Write a Pandas program to find the Indexes of missing values in a given DataFrame.(Hint : np.isnull().to_numpy())

In [90]:
mask = list(df.customer_id.isnull().to_numpy().nonzero()[0])
mask

[0, 3, 11]

In [91]:
df.loc[mask]

    ord_no  purch_amt ord_date  customer_id
0      NaN        NaN      NaN          NaN
3      NaN        NaN      NaN          NaN
11     NaN        NaN      NaN          NaN

In [92]:
df

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3       NaN        NaN         NaN          NaN
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11      NaN        NaN         NaN          NaN

### Write a Pandas program to replace the missing values with the most frequent values present in each column of a given dataframe.(Hint : df.mode())

In [94]:
df.fillna(value=df.mode(), inplace=True)

In [97]:
df.fillna(value=df.mean())

/tmp/ipykernel_284401/1364442528.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(value=df.mean())

          ord_no  purch_amt    ord_date  customer_id
0   70002.000000      65.26  2012-09-10       3001.0
1   70003.000000     270.65  2012-09-10       3001.0
2   70002.000000      65.26         NaN       3001.0
3   70010.000000     270.65         NaN       3001.7
4   70012.000000     948.50  2012-09-10       3002.0
5   70005.000000    2400.60  2012-07-27       3001.0
6   70006.555556    5760.00  2012-09-10       3001.0
7   70010.000000    1983.43  2012-10-10       3004.0
8   70003.000000    2480.40  2012-10-10       3003.0
9   70012.000000     250.45  2012-06-27       3002.0
10  70006.555556      75.29  2012-08-17       3001.0
11  70006.555556    1324.59         NaN       3001.7

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ord_no       9 non-null      float64
 1   purch_amt    11 non-null     float64
 2   ord_date     9 non-null      object
 3   customer_id  10 non-null     float64
dtypes: float64(3), object(1)
memory usage: 512.0+ bytes

## Bonus

## Create a hitmap for more information about the distribution of missing values in a given DataFrame.

In [105]:
# import seaborn as sns
# # sns.heatmap(df.isna(), )
# sns.heatmap(df.corr(), annot=True)

# Pandas - Assignment no 08
- Here is link of [Pandas - Assignment no 08]()

### [Project : Clean And Analyze Employee Exit Surveys](https://github.com/AnshuTrivedi/Data-Scientist-In-Python/blob/master/Projects/step_2/Course_4/Guided%20Project_Clean%20And%20Analyze%20Employee%20Exit%20Surveys.ipynb)

**In this guided project, we'll work with exit surveys from employees of the Department of Education, Training and Employment) (DETE) and the Technical and Further Education (TAFE) institute in Queensland, Australia. You can find the TAFE exit survey here and the survey for the DETE here. We've made some slight modifications to these datasets to make them easier to work with, including changing the encoding to UTF-8 (the original ones are encoded using cp1252.)**



Our end goal is to answer the following question:

**Are employees who have only worked for the institutes for a short period of time resigning due to some kind of dissatisfaction? What about employees who have been at the job longer?**

#### Import the libraries and load the dataset

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from warnings import filterwarnings
filterwarnings('ignore')
pd.set_option('display.max_columns',100)
pd.set_option('display.max_rows',100)

In [ ]:
tafe_survey = pd.read_csv('datasets/tafe_survey.csv')
dete_survey = pd.read_csv('datasets/dete_survey.csv')

In [ ]:
# birdeye view of dataset
tafe_survey.sample(5)

In [ ]:
# get basic information of dataset
tafe_survey.info()

In [ ]:
dete_survey = pd.read_csv('datasets/dete_survey.csv')
dete_survey.sample(5)

In [ ]:
dete_survey.info()

In [ ]:
# check null/missing values into both dataframes

In [ ]:
tafe_survey.isnull().sum()

In [ ]:
dete_survey.isnull().sum()

We can make the following observations based on the work above:
- The dete_survey dataframe contains 'Not Stated' values that indicate values are missing, but they aren't represented as NaN.
- Both the dete_survey and tafe_survey contain many columns that we don't need to complete our analysis.
- Each dataframe contains many of the same columns, but the column names are different. There are multiple columns/answers that indicate an employee resigned because they were dissatisfied.

### Identify Missing Values and Drop Unnecessary Columns

In [ ]:
# just use the following columns from the `dete_dataset`

dete_columns = ['ID', 'SeparationType', 'Cease Date', 'DETE Start Date',
       'Role Start Date', 'Position', 'Classification', 'Region',
       'Business Unit', 'Employment Status', 'Career move to public sector',
       'Career move to private sector', 'Interpersonal conflicts',
       'Job dissatisfaction', 'Dissatisfaction with the department',
       'Physical work environment', 'Lack of recognition',
       'Lack of job security', 'Work location', 'Employment conditions',
       'Maternity/family', 'Relocation', 'Study/Travel', 'Ill Health',
       'Traumatic incident', 'Work life balance', 'Workload',
       'None of the above', 'Gender', 'Age', 'Aboriginal', 'Torres Strait',
       'South Sea', 'Disability', 'NESB']
# Read in the data again, but this time read `Not Stated` values as `NaN`

dete_survey_updated = pd.read_csv('datasets/dete_survey.csv', usecols=dete_columns, na_values='Not Stated')
dete_survey_updated.head()

In [ ]:
dete_survey_updated.info()

In [ ]:
# just use the following columns from the `dete_dataset`

tafe_columns = ['Record ID', 'Institute', 'WorkArea', 'CESSATION YEAR',
       'Reason for ceasing employment',
       'Contributing Factors. Career Move - Public Sector ',
       'Contributing Factors. Career Move - Private Sector ',
       'Contributing Factors. Career Move - Self-employment',
       'Contributing Factors. Ill Health',
       'Contributing Factors. Maternity/Family',
       'Contributing Factors. Dissatisfaction',
       'Contributing Factors. Job Dissatisfaction',
       'Contributing Factors. Interpersonal Conflict',
       'Contributing Factors. Study', 'Contributing Factors. Travel',
       'Contributing Factors. Other', 'Contributing Factors. NONE',
       'Gender. What is your Gender?', 'CurrentAge. Current Age',
       'Employment Type. Employment Type', 'Classification. Classification',
       'LengthofServiceOverall. Overall Length of Service at Institute (in years)',
       'LengthofServiceCurrent. Length of Service at current workplace (in years)']

# Read in the data again, but this time read `Not Stated` values as `NaN`
tafe_survey_updated = pd.read_csv('datasets/tafe_survey.csv', usecols=tafe_columns, na_values='Not Stated')
tafe_survey_updated.head()

In [ ]:
tafe_survey_updated.info()

#### Clean column names
To clean the column names, following steps take place
- convert upper case into lower case 
- remove left and right white spaces
- remove white spaces with `-`

In [ ]:
dete_survey_updated.columns =  dete_survey_updated.columns.str.lower().str.strip().str.replace(' ','_')
dete_survey_updated.head()

#### Update column names of `tafe_survey_updated` to match the names in dete_survey_updated

In [ ]:
tafe_survey_updated.head()

In [ ]:
# Update column names to match the names in dete_survey_updated
mapping = {'Record ID': 'id', 'CESSATION YEAR': 'cease_date', 'Reason for ceasing employment': 'separationtype', 'Gender. What is your Gender?': 'gender', 'CurrentAge. Current Age': 'age',
       'Employment Type. Employment Type': 'employment_status',
       'Classification. Classification': 'position',
       'LengthofServiceOverall. Overall Length of Service at Institute (in years)': 'institute_service',
       'LengthofServiceCurrent. Length of Service at current workplace (in years)': 'role_service'}
tafe_survey_updated = tafe_survey_updated.rename(mapping, axis = 1)

# Check that the specified column names were updated correctly
tafe_survey_updated.columns

In [ ]:
tafe_survey_updated.head()

### Filter the Data
- Check the unique values for the `separationtype` column in both datasets
- Update all separation types containing the word `resignation` in `dete_survey_updated` dataset to `Resignation`
- Select only the `resignation` separation types from each dataframe

In [ ]:
tafe_survey_updated.separationtype.value_counts()

In [ ]:
dete_survey_updated.separationtype.value_counts()

In [ ]:
dete_survey_updated.separationtype =  dete_survey_updated.separationtype.str.split('-').str[0]
dete_survey_updated.separationtype.value_counts()

In [ ]:
dete_reg = dete_survey_updated[dete_survey_updated.separationtype == 'Resignation']
tafe_reg =  tafe_survey_updated[tafe_survey_updated.separationtype == 'Resignation']

> Note: `dete_reg` and `tafe_reg` are our final datasets for working on this project

### Verify the Data

Now, before we start cleaning and manipulating the rest of our data, let's verify that the data doesn't contain any major inconsistencies (to the best of our knowledge). When you're working with real world data, don't assume that the data you're analyzing isn't corrupted in some way! Below, we clean and explore the `cease_date` and `dete_start_date` columns to make sure all of the years make sense. We'll use the following criteria:

- Since the `cease_date` is the last year of the person's employment and the `dete_start_date` is the person's first year of employment, it wouldn't make sense to have years after the current date. Given that most people in this field start working in their 20s, it's also unlikely that the dete_start_date was before the year 1940.

- Check the unique values of `cease_date`.
- After that extract the years and convert them to a float type.
- Check the unique values of `dete_start_date` and look for outliers.
- Check the unique values of `cease_date` in `tafe_reg` dataframe

In [ ]:
dete_reg.cease_date.value_counts()

In [ ]:
dete_reg.cease_date =  dete_reg.cease_date.str.split('/').str[-1]
dete_reg.cease_date.value_counts()

In [ ]:
dete_reg.cease_date = dete_reg.cease_date.astype(float)
dete_reg.cease_date.value_counts()

> **findings**: The years in both dataframes don't completely align. The `tafe_survey_updated` dataframe contains some cease dates in 2009, but the `dete_survey_updated` dataframe does not. The `tafe_survey_updated` dataframe also contains many more cease dates in 2010 than the `dete_survey_updaed` dataframe. Since we aren't concerned with analyzing the results by year, we'll leave them as is.

### Create a New Column
Since our end goal is to answer the question below, we need a column containing the length of time an employee spent in their workplace, or years of service, in both dataframes.
#### End goal: 
- Are employees who have only worked for the institutes for a short period of time resigning due to some kind of `dissatisfaction`? What about employees who have been at the job longer? The `tafe_resignations` dataframe already contains a `service` column, which we renamed to institute_service.

#### Task:
- we calculate the years of `service` in the `dete_survey_updated` dataframe by subtracting the `dete_start_date` from the `cease_date` and create a new column named institute_service.

In [ ]:
dete_reg['institute_service']= dete_reg.cease_date - dete_reg.dete_start_date
dete_reg.head()

### Identify Dissatisfied Employees

Next, we'll identify any employees who resigned because they were dissatisfied. Below are the columns we'll use to categorize employees as "dissatisfied" from each dataframe:

##### tafe_survey_updated:
- Contributing Factors. Dissatisfaction
- Contributing Factors. Job Dissatisfaction

##### dafe_survey_updated:

- job_dissatisfaction
- dissatisfaction_with_the_department
- physical_work_environment
- lack_of_recognition
- lack_of_job_security
- work_location
- employment_conditions
- work_life_balance
- workload

#### Task : 
If the employee indicated any of the factors above caused them to resign, we'll mark them as dissatisfied in a new column. After our changes, the new dissatisfied column will contain just the following values:

- True: indicates a person resigned because they were dissatisfied in some way
- False: indicates a person resigned because of a reason other than dissatisfaction with the job
- NaN: indicates the value is missing

In [ ]:
tafe_reg['Contributing Factors. Dissatisfaction'].value_counts()

In [ ]:
tafe_reg['Contributing Factors. Job Dissatisfaction'].value_counts()

In [ ]:
def update_vals(x):
    if x=='-':
        return False
    elif pd.isnull(x):
        return np.nan
    else:
        return True

In [ ]:
tafe_reg['dissatisfied'] = tafe_reg[['Contributing Factors. Dissatisfaction', 'Contributing Factors. Job Dissatisfaction']].applymap(update_vals).any(1, skipna=False)

In [ ]:
tafe_reg.dissatisfied.value_counts(dropna=False)

In [ ]:
# Update the values in columns related to dissatisfaction to be either True, False, or NaN
dete_reg['dissatisfied'] = dete_reg[['job_dissatisfaction',
       'dissatisfaction_with_the_department', 'physical_work_environment',
       'lack_of_recognition', 'lack_of_job_security', 'work_location',
       'employment_conditions', 'work_life_balance',
       'workload']].any(1, skipna=False)

In [ ]:
dete_reg['dissatisfied'].value_counts(dropna=False)

### Combine the Data

Below, we'll add an institute column so that we can differentiate the data from each survey after we combine them. Then, we'll combine the dataframes and drop any remaining columns we don't nee

In [ ]:
# Add an institute column
dete_reg['institute'] = 'DETE'
tafe_reg['institute'] = 'TAFE'

In [ ]:
dete_reg.head()

In [ ]:
# Combine the dataframes
combined = pd.concat([dete_reg, tafe_reg], ignore_index=True)

# Verify the number of non null values in each column
combined.notnull().sum().sort_values()

In [ ]:
# Drop columns with less than 500 non null values
combined_updated = combined.dropna(thresh = 500, axis =1)

In [ ]:
combined_updated.notnull().sum().sort_values()

In [ ]:
combined_updated.shape

In [ ]:
# combined_updated.isna().sum()

### Clean the Service Column

Next, we'll clean the institute_service column and categorize employees according to the following definitions:

- New: Less than 3 years in the workplace
- Experienced: 3-6 years in the workplace
- Established: 7-10 years in the workplace
- Veteran: 11 or more years in the workplace

#### Task : 
- Check the unique values of `institute_service` 
- Extract the years of service and convert the type to float

In [ ]:
combined_updated.institute_service.value_counts()

In [ ]:
# Extract the years of service and convert the type to float
combined_updated['institute_service_up'] = combined_updated['institute_service'].astype('str').str.extract(r'(\d+)')
combined_updated['institute_service_up'] = combined_updated['institute_service_up'].astype('float')

# Check the years extracted are correct
combined_updated['institute_service_up'].value_counts()

In [ ]:
# Convert years of service to categories
def transform_service(val):
    if val >= 11:
        return "Veteran"
    elif 7 <= val < 11:
        return "Established"
    elif 3 <= val < 7:
        return "Experienced"
    elif pd.isnull(val):
        return np.nan
    else:
        return "New"
combined_updated['service_cat'] = combined_updated['institute_service_up'].apply(transform_service)

# Quick check of the update
combined_updated['service_cat'].value_counts()

### Perform Initial Analysis

Finally, we'll replace the missing values in the `dissatisfied` column with the most frequent value, `False`. Then, we'll calculate the percentage of employees who resigned due to dissatisfaction in each `service_cat` group and `plot` the results.

Note that since we still have additional missing values left to deal with, this is meant to be an initial introduction to the analysis, not the final analysis.

In [ ]:
# Verify the unique values
combined_updated['dissatisfied'].value_counts(dropna=False)

In [ ]:
# Replace missing values with the most frequent value, False
combined_updated['dissatisfied'] = combined_updated['dissatisfied'].fillna(False)

In [ ]:
combined_updated.service_cat.value_counts()

In [ ]:
# Calculate the percentage of employees who resigned due to dissatisfaction in each category
dis_pct = combined_updated.pivot_table(index='service_cat', values='dissatisfied')
dis_pct

In [ ]:
# Plot the results
%matplotlib inline
dis_pct.plot(kind='bar', rot=30, figsize=(7,7))

> **Note** : From the initial analysis above, we can tentatively conclude that employees with 7 or more years of service are more likely to resign due to some kind of dissatisfaction with the job than employees with less than 7 years of service. However, we need to handle the rest of the missing data to finalize our analysis.

In this guided project, we experienced that in order to extract any meaningful insights from our data, we had to perform many data cleaning tasks. In order to create one visualization (and not even the final one), we completed the following tasks:

- Explored the data and figured out how to prepare it for analysis
- Corrected some of the missing values
- Dropped any data not needed for our analysis
- Renamed our columns
- Verified the quality of our data
- Created a new institute_service column
- Cleaned the Contributing Factors columns
- Created a new column indicating if an employee resigned because they were dissatisfied in some way
- Combined the data
- Cleaned the institute_service column
- Handled the missing values in the dissatisfied column
- Aggregated the data